// Lab_03_4.cpp
// ГалаганВадим
// Лабораторна робота No 3.4
// Розгалуження, задане плоскою фігурою.
// Варіант 2
#include <iostream>
using namespace std;
int main()
{
	double x; // вхідний аргумент
	double y; // вхідний параметр
	double R; // вхідний параметр
	cout << "x = "; cin >> x;
	cout << "y = "; cin >> y;
	cout << "R = "; cin >> R;
	// розгалуження в повній формі
	if ( (y<= 0 && x<=0) && (pow(x,2)+pow(y,2)<=pow(R,2)) || ( (y <= 0 && y >= -R) && (x >= 0 && x <= R) && (y >= -2*x ) && (y>=-2*R+2*x)) )
		cout << "yes" << endl; // якшо вказана точка входить в область
	else
		cout << "no" << endl;  // якшо вказана точка не входить в область
	cin.get();
	return 0;
}
